// Вывести на экран число «ПИ» с точностью до сотых. //

double numberPi = Math.PI;
Console.WriteLine(Math.Round(numberPi, 2));