// Вывести на экран число e (основание натурального логарифма) с точностью до десятых. //

double numberE = Math.E;
Console.WriteLine(Math.Round(numberE, 2));